app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "email", "mobile_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "deep1"], ["LIMIT", 1]]
---
  def authenticate_user
    user = User.find_by(username: user_params[:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: user_params[:id])